#### 01 Filtering, Min, Median

In [34]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

In [35]:
df.head()

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2024-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2024-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2024-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2024-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2024-03-07  1338.0

In [36]:
df['f5'].value_counts().head()

f5
0.000000     18
83.685380     9
73.586397     9
33.308999     8
67.886373     7
Name: count, dtype: int64

In [49]:
df = df[df['f5'] != 0]
df['f5'].value_counts().head()

f5
73.586397    9
83.685380    9
33.308999    8
67.886373    7
17.252986    6
Name: count, dtype: int64

In [51]:
df['views'] = df['views'].fillna(df['views'].min())

In [52]:
df.head()

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2024-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2024-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2024-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2024-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2024-03-07  1338.0

In [53]:
print(int(df['views'].median()))

5924

#### 02 Category, Index, String Slicing

In [ ]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

In [3]:
df.head()

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2024-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2024-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2024-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2024-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2024-03-07  1338.0

In [4]:
df['subscribed'].value_counts()

subscribed
2025-02-17    16
2024-06-21     3
2024-04-03     2
2024-07-29     2
2024-05-28     2
              ..
2024-07-08     1
2024-07-20     1
2024-06-10     1
2024-02-01     1
2024-05-20     1
Name: count, Length: 96, dtype: int64

In [19]:
int(df['subscribed'].value_counts().index[0][-2:])

17

#### 03 Derived Variavle, Sort, Indexing

In [80]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

In [94]:
df = df.dropna()

In [95]:
df['new'] = df['views'] / df['f1']

In [96]:
df = df.sort_values('new', ascending=False)

In [98]:
int(df.iloc[0,1])

22

#### 04 Changing value, Sort, Sum

In [100]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")